tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
brew "cloc"
brew "jenv"
brew "ffmpeg"
brew "fish"
brew "ghq"
brew "git"
brew "gitmoji"
brew "gnu-sed"
brew "gnu-time"
brew "openjdk@11"
brew "gradle"
brew "imagemagick"
brew "jq"
brew "openjdk"
brew "kotlin"
brew "ktlint"
brew "make"
brew "peco"
brew "scrcpy"
brew "smartmontools"
brew "starship"
# brew "swiftlint", args: ["force"]
brew "tig"
cask "font-jetbrains-mono-nerd-font"
cask "fork"
cask "google-drive-file-stream"
cask "iterm2"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "mapture"
cask "notion"
cask "timing"
cask "visual-studio-code"
cask "zulu11"
cask "zulu8"
