brew "cloc"
cask "inkdrop"
brew "ffmpeg"
brew "ghq"
brew "git"
brew "gnu-sed"
brew "gnu-time"
brew "gnupg"
brew "imagemagick"
brew "jq"
brew "make"
brew "multitime"
brew "neovim"
brew "peco"
brew "pinentry-mac"
brew "smartmontools"
brew "tig"
cask "android-platform-tools"
cask "font-jetbrains-mono-nerd-font"
cask "fork"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "timing"
cask "visual-studio-code"
cask "ghostty"
cask "cursor"
brew "coreutils"
brew "codex"
cask "claude"
cask "trae"
brew "zsh-autosuggestions"
brew "chezmoi"
