tap "adoptopenjdk/openjdk"
tap "fumiya-kume/mdefaults"
tap "supabase/tap"
tap "xcodesorg/made"
# Run your GitHub Actions locally
brew "act"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Platform built on V8 to build network applications
brew "node"
# CLI tool for analyzing Claude Code usage from local JSONL files
brew "ccusage"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Statistics utility to count lines of code
brew "cloc"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Linux virtual machines
brew "lima"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Program that can automate interactive applications
brew "expect"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Remote repository management made easy
brew "ghq"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU implementation of time utility
brew "gnu-time"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fast linters runner for Go
brew "golangci-lint"
# Deliver Go binaries as fast and easily as possible
brew "goreleaser"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Install and debug iPhone apps from the command-line
brew "ios-deploy"
# Lightweight and flexible command-line JSON processor
brew "jq"
# LLM inference in C/C++
brew "llama.cpp"
# Utility for directing compilation
brew "make"
# Time command execution over multiple executions
brew "multitime"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Generate clients, server & docs from an OpenAPI spec (v2, v3)
brew "openapi-generator"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Simplistic interactive filtering tool
brew "peco"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# CLI for the Pkl programming language
brew "pkl"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# SMART hard drive monitoring
brew "smartmontools"
# Zsh prompt for Astronauts
brew "spaceship"
# Cross-shell prompt for astronauts
brew "starship"
# Formatting technology for Swift source code
brew "swift-format"
# Formatting tool for reformatting Swift code
brew "swiftformat"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# Easiest, most secure way to use WireGuard and 2FA
brew "tailscale"
# Text interface for Git repositories
brew "tig"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# Little beautifier tool for xcodebuild
brew "xcbeautify"
# Build server protocol implementation for integrating Xcode with sourcekit-lsp
brew "xcode-build-server"
# Generate your Xcode project from a spec file and your folder structure
brew "xcodegen"
# XML command-line utilities
brew "xmlstarlet"
# JavaScript package manager
brew "yarn"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Install and switch between multiple versions of Xcode
brew "xcodesorg/made/xcodes"
# GPU-accelerated terminal emulator
cask "alacritty"
# Android SDK component
cask "android-platform-tools"
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "basictex"
# Write, edit, and chat about your code with AI
cask "cursor"
# Collaborative team software
cask "figma"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
cask "font-jetbrains-mono-nerd-font"
# GIT client
cask "fork"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Client for the Google Drive storage service
cask "google-drive"
# Desktop automation application
cask "hammerspoon"
# Markdown editor
cask "inkdrop"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Keyboard customiser
cask "karabiner-elements"
# App to write, plan, collaborate, and get organised
cask "notion"
# Collaboration platform for API development
cask "postman"
# Automatic time and productivity tracking app
cask "timing"
# Create, maintain, and interact with Xcode projects at scale
cask "tuist"
# Open-source code editor
cask "visual-studio-code"
# Open-source code editor
cask "visual-studio-code@insiders"
# Multiplayer code editor
cask "zed"
vscode "anthropic.claude-code"
vscode "christian-kohler.npm-intellisense"
vscode "docker.docker"
vscode "dotjoshjohnson.xml"
vscode "fwcd.kotlin"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "huacat.office-theme"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "ms-azuretools.vscode-containers"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "openai.chatgpt"
vscode "pkief.material-icon-theme"
vscode "saoudrizwan.claude-dev"
vscode "shopify.ruby-lsp"
vscode "sissel.shopify-liquid"
vscode "svelte.svelte-vscode"
vscode "sweetpad.sweetpad"
vscode "swiftlang.swift-vscode"
vscode "vadimcn.vscode-lldb"
