bmalehorn.vscode-fish
christian-kohler.npm-intellisense
dbaeumer.vscode-eslint
donjayamanne.jupyter
eamodio.gitlens
GitHub.vscode-pull-request-github
golang.go
jithurjacob.nbpreviewer
ms-azuretools.vscode-azurefunctions
ms-azuretools.vscode-docker
ms-dotnettools.csharp
ms-python.anaconda-extension-pack
ms-python.python
ms-toolsai.jupyter
ms-vscode-remote.remote-containers
ms-vscode.azure-account
ms-vscode.cpptools
ms-vsliveshare.vsliveshare
octref.vetur
quicktype.quicktype
redhat.java
redhat.vscode-yaml
skyapps.fish-vscode
VisualStudioExptTeam.vscodeintellicode
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
