tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
brew "jpeg"
brew "webp"
brew "openjdk@11"
brew "bazel"
brew "cloc"
cask "hammerspoon"
brew "ffmpeg"
brew "fish"
brew "ghq"
brew "git"
brew "gitmoji"
brew "gnu-sed"
brew "gnu-time"
brew "gnupg"
brew "go"
brew "openjdk"
brew "tmux"
brew "gradle"
brew "imagemagick"
brew "jenv"
brew "jq"
brew "kotlin"
brew "ktlint"
brew "make"
brew "multitime"
brew "neovim"
brew "rbenv"
brew "ruby-build"
brew "ninja"
brew "peco"
cask "alacritty"
brew "pinentry-mac"
brew "scrcpy"
brew "smartmontools"
brew "starship"
brew "swiftlint"
brew "tig"
cask "android-platform-tools"
cask "font-jetbrains-mono-nerd-font"
cask "fork"
cask "google-drive"
cask "iterm2"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "mapture"
cask "notion"
cask "timing"
cask "visual-studio-code"
cask "zulu11"
cask "zulu8"
