tap "homebrew/bundle"
tap "homebrew/cask-fonts"
brew "cloc"
cask "hammerspoon"
cask "inkdrop"
brew "ffmpeg"
brew "fish"
brew "ghq"
brew "git"
brew "gnu-sed"
brew "gnu-time"
brew "gnupg"
brew "imagemagick"
brew "jq"
brew "make"
brew "multitime"
brew "neovim"
brew "peco"
cask "alacritty"
brew "pinentry-mac"
brew "smartmontools"
brew "starship"
brew "tig"
cask "android-platform-tools"
cask "font-jetbrains-mono-nerd-font"
cask "fork"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "timing"
cask "visual-studio-code"
cask "google-chrome"
cask "cursor"
